//
//  WeatherLocale.swift
//  WeatherApp
//
//  Created by 박준영 on 2022/03/30.
//

import Foundation
typealias Gungu = [String: Point<Int>]
enum Sido: String {
    case Gangwon = "강원도"
    case Gyeonggi = "경기도"
    case Gyeongsangnam = "경상남도"
    case Gyeongsangbuk = "경상북도"
    case Gwangju = "광주광역시"
    case Daegu = "대구광역시"
    case Daejeon = "대전광역시"
    case Busan = "부산광역시"
    case Seoul = "서울특별시"
    case Sejong = "세종특별자치시"
    case Ulsan = "울산광역시"
    case Incheon = "인천광역시"
    case Jeollanam = "전라남도"
    case Jeollabuk = "전라북도"
    case Jeju = "제주특별자치도"
    case Chungcheongnam = "충청남도"
    case Chungcheongbuk = "충청북도"
}
let sido: [String] = ["강원도", "경기도", "경상남도", "경상북도", "광주광역시", "대구광역시", "대전광역시", "부산광역시", "서울특별시", "세종특별자치시", "울산광역시", "인천광역시", "전라남도", "전라북도", "제주특별자치도", "충청남도", "충청북도"]
// 강원도
let Gangwon: [String: Point<Int>] = ["강릉시":(92,131), "고성군":(85,145), "동해시":(97,127), "삼척시":(98,125), "속초시":(87,141), "양구군":(77,139), "양양군":(88,138), "영월군":(86,119), "원주시":(76,122), "인제군":(80,138), "정선군":(89,123), "철원군":(65,139), "춘천시":(73,134), "태백시":(95,119), "평창군":(84,123), "홍천군":(75,130), "화천군":(72,139), "횡성군":(77,125)]
// 경기도
let Gyeonggi: [String: Point<Int>] = ["가평군":(69,133), "고양시덕양구":(57,128), "고양시일산동구":(56,129), "고양시일산서구":(56,129), "과천시":(60,124), "광명시":(58,125), "광주시":(65,123), "구리시":(62,127), "군포시":(59,122), "김포시":(55,128), "남양주시":(64,128), "동두천시":(61,134), "부천시":(56,125), "성남시분당구":(62,123), "성남시수정구":(63,124), "성남시중원구":(63,124), "수원시권선구":(60,120), "수원시영통구":(61,120), "수원시장안구":(60,121), "수원시팔달구":(61,121), "시흥시":(57,123), "안산시단원구":(57,121), "안산시상록구":(58,121), "안성시":(65,115), "안양시동안구":(59,123), "안양시만안구":(59,123), "양주시":(61,131), "양평군":(69,125), "여주시":(71,121), "연천군":(61,138), "오산시":(62,118), "용인시기흥구":(62,120), "용인시수지구":(62,121), "용인시처인구":(64,119), "의왕시":(60,122), "의정부시":(61,130), "이천시":(68,121), "파주시":(56,131), "평택시":(62,114), "포천시":(64,134), "하남시":(64,126), "화성시":(57,119)]
// 경상남도
let Gyeongsangnam: [String: Point<Int>] = ["거제시":(90,69), "거창군":(77,86), "고성군":(85,71), "김해시":(95,77), "남해군":(77,68), "밀양시":(92,83), "사천시":(80,71), "산청군":(76,80), "양산시":(97,79), "의령군":(83,78), "진주시":(81,75), "창녕군":(87,83), "창원시 마산합포구":(89,76), "창원시 마산회원구":(89,76), "창원시 성산구":(91,76), "창원시 의창구":(90,77), "창원시 진해구":(91,75), "통영시":(87,68), "하동군":(74,73), "함안군":(86,77), "함양군":(74,82), "합천군":(81,84)]
// 경상북도
let Gyeongsangbuk: [String: Point<Int>] = ["경산시":(91,90), "경주시":(100,91), "고령군":(83,87), "구미시":(84,96), "군위군":(88,99), "김천시":(80,96), "문경시":(81,106), "봉화군":(90,113), "상주시":(81,102), "성주군":(83,91), "안동시":(91,106), "영덕군":(102,103), "영양군":(97,108), "영주시":(89,111), "영천시":(95,93), "예천군":(86,107), "울릉군":(127,127), "울진군":(102,115), "의성군":(90,101), "청도군":(91,86), "청송군":(96,103), "칠곡군":(85,93), "포항시남구":(102,94), "포항시북구":(102,95)]
// 광주광역시
let Gwangju: [String: Point<Int>] = ["광산구":(57,74), "남구":(59,73), "동구":(60,74), "북구":(59,75), "서구":(59,74)]
// 대구광역시
let Daegu: [String: Point<Int>] = ["남구":(89,90), "달서구":(88,90), "달성군":(86,88), "동구":(90,91), "북구":(89,91), "서구":(88,90), "수성구":(89,90), "중구":(89,90)]
// 대전광역시
let Daejeon: [String: Point<Int>] = ["대덕구":(68,100), "동구":(68,100), "서구":(67,100), "유성구":(67,101), "중구":(68,100)]
// 부산광역시
let Busan: [String: Point<Int>] = ["강서구":(96,76), "금정구":(98,77), "기장군":(100,77), "남구":(98,75), "동구":(98,75), "동래구":(98,76), "부산진구":(97,75), "북구":(96,76), "사상구":(96,75), "사하구":(96,74), "서구":(97,74), "수영구":(99,75), "연제구":(98,76), "영도구":(98,74), "중구":(97,74), "해운대구":(99,75)]
// 서울특별시
let Seoul: [String: Point<Int>] = ["강남구":(61,126), "강동구":(62,126), "강북구":(61,128), "강서구":(58,126), "관악구":(59,125), "광진구":(62,126), "구로구":(58,125), "금천구":(59,124), "노원구":(61,129), "도봉구":(61,129), "동대문구":(61,127), "동작구":(59,125), "마포구":(59,127), "서대문구":(59,127), "서초구":(61,125), "성동구":(61,127), "성북구":(61,127), "송파구":(62,126), "양천구":(58,126), "영등포구":(58,126), "용산구":(60,126), "은평구":(59,127), "종로구":(60,127), "중구":(60,127), "중랑구":(62,128)]
// 세종특별자치시
let Sejong: [String: Point<Int>] = ["세종특별자치시":(66,103)]
// 울산광역시
let Ulsan: [String: Point<Int>] = ["남구":(102,84), "동구":(104,83), "북구":(103,85), "울주군":(101,84), "중구":(102,84)]
// 인천광역시
let Incheon: [String: Point<Int>] = ["강화군":(51,130), "계양구":(56,126), "남동구":(56,124), "동구":(54,125), "미추홀구":(54,124), "부평구":(55,125), "서구":(55,126), "연수구":(55,123), "옹진군":(54,124), "중구":(54,125)]
// 전라남도
let Jeollanam: [String: Point<Int>] = ["강진군":(57,63), "고흥군":(66,62), "곡성군":(66,77), "광양시":(73,70), "구례군":(69,75), "나주시":(56,71), "담양군":(61,78), "목포시":(50,67), "무안군":(52,71), "보성군":(62,66), "순천시":(70,70), "신안군":(50,66), "여수시":(73,66), "영광군":(52,77), "영암군":(56,66), "완도군":(57,56), "장성군":(57,77), "장흥군":(59,64), "진도군":(48,59), "함평군":(52,72), "해남군":(54,61), "화순군":(61,72)]
// 전라북도
let Jeollabuk: [String: Point<Int>] = ["고창군":(56,80), "군산시":(56,92), "김제시":(59,88), "남원시":(68,80), "무주군":(72,93), "부안군":(56,87), "순창군":(63,79), "완주군":(63,89), "익산시":(60,91), "임실군":(66,84), "장수군":(70,85), "전주시덕진구":(63,89), "전주시완산구":(63,89), "정읍시":(58,83), "진안군":(68,88)]
// 제주특별자치도
let Jeju: [String: Point<Int>] = ["서귀포시":(52,33), "이어도":(28,8), "제주시":(53,38)]
// 충청남도
let Chungcheongnam: [String: Point<Int>] = ["계룡시":(65,99), "공주시":(63,102), "금산군":(69,95), "논산시":(62,97), "당진시":(54,112), "보령시":(54,100), "부여군":(59,99), "서산시":(51,110), "서천군":(55,94), "아산시":(60,110), "예산군":(58,107), "천안시동남구":(63,110), "천안시서북구":(63,112), "청양군":(57,103), "태안군":(48,109), "홍성군":(55,106)]
// 충청북도
let Chungcheongbuk: [String: Point<Int>] = ["괴산군":(74 ,111), "단양군":(84,115), "보은군":(73,103), "영동군":(74,97), "옥천군":(71,99), "음성군":(72,113), "제천시":(81,118), "증평군":(71,110), "진천군":(68,111), "청주시상당구":(69,106), "청주시서원구":(69,107), "청주시청원구":(69,107), "청주시흥덕구":(67,106), "충주시":(76,114)]

struct WeatherLocale {
    let sido: Sido
    let gungu: Gungu
}
func weatherLocaleInit() -> [WeatherLocale] {
    var locales = [WeatherLocale]()
    locales = [
        WeatherLocale(sido: .Gangwon, gungu: Gangwon),
        WeatherLocale(sido: .Gyeonggi, gungu: Gyeonggi),
        WeatherLocale(sido: .Gyeongsangnam, gungu: Gyeongsangnam),
        WeatherLocale(sido: .Gyeongsangbuk, gungu: Gyeongsangbuk),
        WeatherLocale(sido: .Gwangju, gungu: Gwangju),
        WeatherLocale(sido: .Daegu, gungu: Daegu),
        WeatherLocale(sido: .Daejeon, gungu: Daejeon),
        WeatherLocale(sido: .Busan, gungu: Busan),
        WeatherLocale(sido: .Seoul, gungu: Seoul),
        WeatherLocale(sido: .Sejong, gungu: Sejong),
        WeatherLocale(sido: .Ulsan, gungu: Ulsan),
        WeatherLocale(sido: .Incheon, gungu: Incheon),
        WeatherLocale(sido: .Jeollanam, gungu: Jeollanam),
        WeatherLocale(sido: .Jeollabuk, gungu: Jeollabuk),
        WeatherLocale(sido: .Jeju, gungu: Jeju),
        WeatherLocale(sido: .Chungcheongnam, gungu: Chungcheongnam),
        WeatherLocale(sido: .Chungcheongbuk, gungu: Chungcheongbuk)
    ]
    return locales
}
